Revit 2026 API

# Path3dCurveLoop Property

---

Get the Curve Loop of Path3d via index.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveArray this[
	int index
] { get; }
```
```vb
Public ReadOnly Property CurveLoop (
	index As Integer
) As CurveArray
	Get
```
```cpp
public:
property CurveArray^ CurveLoop[int index] {
	CurveArray^ get (int index);
}
```
```fsharp
member CurveLoop : CurveArray with get
```

#### Parameters

index Int32

#### Property Value

CurveArray

Returns the index order Curve Loop of Path3d.

#### Reference

Path3d Class

Autodesk.Revit.DB Namespace